app/controllers/items_controller.rb

  def create
    @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visit Narnia"], ["done", "f"], ["todo_id", 1], ["created_at", "2017-10-07 16:49:44.741612"], ["updated_at", "2017-10-07 16:49:44.741612"]]

  def update
    @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Hold me"], ["done", "t"], ["updated_at", "2017-10-07 16:55:07.110537"], ["id", 2]]