app/controllers/todos_controller.rb

  def update
    @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "created_by" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "The aaa"], ["created_by", "3"], ["updated_at", "2017-10-07 16:38:10.963866"], ["id", 3]]